# GetLayerCutPlane

## Description
Gets the cut plane of the layer.

```pascal
FUNCTION GetLayerCutPlane(layer : HANDLE): REAL;
```

```python
def vs.GetLayerCutPlane(layer):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layer|HANDLE|The layer.|

## See Also
VS Functions:
SetLayerCutPlane

## Version
Availability: from Vectorworks 2017

## Category
* Layers